import { NadbarTemplate } from '../../common/nadbarTypes';

export const DEFAULT_LEHAT_TEMPLATE: NadbarTemplate = {
  id: 'lehat_v1',
  name: 'להט',
  version: '1.0',
  elements: [
    {
      type: 'conversation',
      targetFields: ['name', 'eastCoord', 'northCoord', 'height'],
      data: [
        {
          type: 'me',
          data: "ראם מציפור, האם אתה מבלה בענבים?"
        },
        {
          type: 'they',
          data: "חיובי, מבלה בענבים/שלילי, כמה קטנות"
        },
        {
          type: 'me',
          data: "קבל, קו״צ __, כמו כן, גור __ מעל פני הים."
        },
        {
          type: 'they',
          data: "קיבלתי, קו״צ __, גור__."
        },
        {
          type: 'me',
          data: "קבל למטרה {{name}} מרעום {{eastCoord}} (ספרה ספרה) צפע {{northCoord}} (ספרה ספרה)"
        },
        {
          type: 'they',
          data: "קיבלתי, למטרה __ (מספר שלם) מרעום __ (ספרה ספרה) צפע __ (ספרה ספרה)"
        },
        {
          type: 'me',
          data: "כמו כן, גמל {{height}} במטרים (מספר שלם)"
        },
        {
          type: 'they',
          data: "קיבלתי, גמל __ במטרים (מספר שלם). קבל, אמורה __ במעלות."
        },
        {
          type: 'me',
          data: "קיבלתי, אמורה __ במעלות. קבל אמורה תקינה/לא תקינה- שפר ל__ במעלות"
        },
        {
          type: 'me',
          data: "קבל למטרה {{name}} נדרש מסלול קשתי ללא/ימני/שמאלי היסט מהנקודה ל(ללא/ימין/שמאל/למעלה/למטה) השהייה מסוג ללא/קצרה/ארוכה"
        },
        {
          type: 'they',
          data: "קיבלתי למטרה __ נדרש מסלול קשתי ללא/ימני/שמאלי היסט מהנקודה ל(ללא/ימין/שמאל/למעלה/למטה) השהייה מסוג ללא/קצרה/ארוכה"
        },
        {
          type: 'they',
          data: "קבל ניתן לבצע עם מסלול קשתי ללא/ימני/שמאלי היסט מהנקודה ל(ללא/ימין/שמאל/למעלה/למטה) השהייה מסוג ללא/קצרה/ארוכה"
        },
        {
          type: 'me',
          data: "קיבלתי למטרה {{name}} ניתן לבצע עם מסלול קשתי ללא/ימני/שמאלי היסט מהנקודה ל(ללא/ימין/שמאל/למעלה/למטה) השהייה מסוג ללא/קצרה/ארוכה"
        },
        {
          type: 'they',
          data: "קבל, האם יש הסתרים קרובים באיזור המטרה?"
        },
        {
          type: 'me',
          data: "שלילי/חיובי - גובה הסתר ומרחק מהמטרה קבל למטרה __ הללויה"
        },
        {
          type: 'they',
          data: "קיבלתי, הללויה. קבל למטרה __ זמן מעוך משוער __, כמו כן מוקד"
        },
        {
          type: 'me',
          data: "למטרה __ אושר אושר"
        },
        {
          type: 'they',
          data: "קיבלתי אושר אושר - קבל, טורפדו"
        },
        {
          type: 'me',
          data: "קבל למטרה __ פרגול/הפוכה כמו כן - יש צורך בטוניס/אין צורך בטוניס. קבל נתוני השיגור זהים/שונים (פירוט)."
        }
      ]
    },
  ]
}; 